# Filter Numeric Rule Evaluator Methods

Source: https://www.revitapidocs.com/2026/45bf2613-cfba-109f-81d3-dd58c6bcc8dd.htm

---

| Filter Numeric Rule Evaluator Methods |
| --- |

The FilterNumericRuleEvaluator type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | Evaluate(Int64, Int64\) | Derived classes should override this method to implement the desired test. |
|  | Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines  whether the two given double\-precision values satisfy the desired condition or not. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

FilterNumericRuleEvaluator Class Autodesk.Revit.DB Namespace